{
    "styling": {
        "colorScheme": "gradient-green",
        "numPages": 5,
        "needsShadows": true
    },
    "pages": [
        {
            "index": 0,
            "title": "Molecular",
            "content": "I built Molecular so that students studying chemistry would have a cheaper alternative to the thousand-dollar software typically used to view 3D molecules. While Molecular has less functionality than the standard applications used in universities, the ability to create and manipulate 3D structures makes it a good tool for those who can't afford expensive software but still are interested in visualizing molecules.",
            "imageFooter": "molecular/benz-default.png"
        },
        {
            "index": 1,
            "title": "Coloring",
            "content": "Molecular by default uses CPK coloring, but can be configured to use other color systems such as the emission spectra of each atom. The default CPK coloring is standard so that molecules can be recognized without labels.",
            "imageFooter": "molecular/HCF.png"
        },
        {
            "index": 2,
            "title": "Atomic Information",
            "content": "Molecular has the capability to display molecular information such as identity and charge.",
            "imageFooter": "molecular/SF6.png"
        },
        {
            "index": 3,
            "title": "Quantum Mechanical Analysis",
            "content": "Molecular has multiple function to do quantum mechanical and statistical analysis. For example, the Hartree-Fock method is used to determine energy levels and electron densities as shown to the right.",
            "imageFooter": "",
            "carousel": [
                {
                    "imageFooter": "molecular/density.png"
                },
                {
                    "imageFooter": "molecular/total-energy.png"
                },
                {
                    "imageFooter": "molecular/convergence.png"
                }
            ]
        },
        {
            "index": 4,
            "title": "Structural Analysis",
            "content": "Molecular can analyze structures and perform calculations such as finding bond angles.",
            "imageFooter": "molecular/AA-angle.png"
        }
    ],
    "footer": {
        "blurb": "Check out my GitHub repository for Molecular!",
        "imageFooter": "molecular/logo-cropped.png",
        "buttonUrl": "https://github.com/wuguishifu/Molecular-2.0"
    }
}